## staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 2 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                       NAME                        |
|----------|---------------------------------------------------|
| update   | `aws_iam_policy.ecr`                              |
|          | `aws_lambda_function.api`                         |
| recreate | `null_resource.api_gateway_cloudwatch_logging[0]` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
19:07:20.258 STDOUT terraform:   ~ update in-place
19:07:20.258 STDOUT terraform: -/+ destroy and then create replacement
19:07:20.258 STDOUT terraform:  <= read (data resources)
19:07:20.258 STDOUT terraform: Terraform will perform the following actions:
19:07:20.258 STDOUT terraform:   # data.aws_iam_policy_document.ecr will be read during apply
19:07:20.258 STDOUT terraform:   # (depends on a resource or a module with changes pending)
19:07:20.258 STDOUT terraform:  <= data "aws_iam_policy_document" "ecr" {
19:07:20.259 STDOUT terraform:       + id            = (known after apply)
19:07:20.259 STDOUT terraform:       + json          = (known after apply)
19:07:20.259 STDOUT terraform:       + minified_json = (known after apply)
19:07:20.259 STDOUT terraform:       + statement {
19:07:20.259 STDOUT terraform:           + actions   = [
19:07:20.259 STDOUT terraform:               + "ecr:GetAuthorizationToken",
19:07:20.259 STDOUT terraform:             ]
19:07:20.259 STDOUT terraform:           + effect    = "Allow"
19:07:20.259 STDOUT terraform:           + resources = [
19:07:20.259 STDOUT terraform:               + "*",
19:07:20.259 STDOUT terraform:             ]
19:07:20.259 STDOUT terraform:           + sid       = "GetAuthorizationToken"
19:07:20.259 STDOUT terraform:         }
19:07:20.259 STDOUT terraform:       + statement {
19:07:20.259 STDOUT terraform:           + actions   = [
19:07:20.259 STDOUT terraform:               + "ecr:BatchCheckLayerAvailability",
19:07:20.259 STDOUT terraform:               + "ecr:BatchGetImage",
19:07:20.259 STDOUT terraform:               + "ecr:CompleteLayerUpload",
19:07:20.259 STDOUT terraform:               + "ecr:GetDownloadUrlForLayer",
19:07:20.259 STDOUT terraform:               + "ecr:InitiateLayerUpload",
19:07:20.259 STDOUT terraform:               + "ecr:PutImage",
19:07:20.259 STDOUT terraform:               + "ecr:UploadLayerPart",
19:07:20.259 STDOUT terraform:             ]
19:07:20.259 STDOUT terraform:           + effect    = "Allow"
19:07:20.259 STDOUT terraform:           + resources = [
19:07:20.259 STDOUT terraform:               + "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda",
19:07:20.259 STDOUT terraform:             ]
19:07:20.259 STDOUT terraform:           + sid       = "AllowPushPull"
19:07:20.259 STDOUT terraform:         }
19:07:20.259 STDOUT terraform:       + statement {
19:07:20.259 STDOUT terraform:           + actions   = [
19:07:20.259 STDOUT terraform:               + "lambda:GetAlias",
19:07:20.259 STDOUT terraform:               + "lambda:GetFunction",
19:07:20.259 STDOUT terraform:               + "lambda:GetFunctionConfiguration",
19:07:20.259 STDOUT terraform:               + "lambda:ListAliases",
19:07:20.260 STDOUT terraform:               + "lambda:ListVersionsByFunction",
19:07:20.260 STDOUT terraform:               + "lambda:PublishVersion",
19:07:20.260 STDOUT terraform:               + "lambda:UpdateAlias",
19:07:20.260 STDOUT terraform:               + "lambda:UpdateFunctionCode",
19:07:20.260 STDOUT terraform:             ]
19:07:20.260 STDOUT terraform:           + effect    = "Allow"
19:07:20.260 STDOUT terraform:           + resources = [
19:07:20.260 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda",
19:07:20.260 STDOUT terraform:             ]
19:07:20.260 STDOUT terraform:           + sid       = "PermissionsToUpdateFunction"
19:07:20.260 STDOUT terraform:         }
19:07:20.260 STDOUT terraform:       + statement {
19:07:20.260 STDOUT terraform:           + actions   = [
19:07:20.260 STDOUT terraform:               + "lambda:GetLayerVersion",
19:07:20.260 STDOUT terraform:             ]
19:07:20.260 STDOUT terraform:           + effect    = "Allow"
19:07:20.260 STDOUT terraform:           + resources = [
19:07:20.260 STDOUT terraform:               + "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*",
19:07:20.260 STDOUT terraform:             ]
19:07:20.260 STDOUT terraform:           + sid       = "PermissionsToDownloadNewRelicLambdaLayers"
19:07:20.260 STDOUT terraform:         }
19:07:20.260 STDOUT terraform:     }
19:07:20.260 STDOUT terraform:   # aws_iam_policy.ecr will be updated in-place
19:07:20.260 STDOUT terraform:   ~ resource "aws_iam_policy" "ecr" {
19:07:20.260 STDOUT terraform:         id               = "arn:aws:iam::239043911459:policy/ecr-api-lambda-access"
19:07:20.260 STDOUT terraform:         name             = "ecr-api-lambda-access"
19:07:20.260 STDOUT terraform:       ~ policy           = jsonencode(
19:07:20.260 STDOUT terraform:             {
19:07:20.260 STDOUT terraform:               - Statement = [
19:07:20.260 STDOUT terraform:                   - {
19:07:20.260 STDOUT terraform:                       - Action   = "ecr:GetAuthorizationToken"
19:07:20.260 STDOUT terraform:                       - Effect   = "Allow"
19:07:20.261 STDOUT terraform:                       - Resource = "*"
19:07:20.261 STDOUT terraform:                       - Sid      = "GetAuthorizationToken"
19:07:20.261 STDOUT terraform:                     },
19:07:20.261 STDOUT terraform:                   - {
19:07:20.261 STDOUT terraform:                       - Action   = [
19:07:20.261 STDOUT terraform:                           - "ecr:UploadLayerPart",
19:07:20.261 STDOUT terraform:                           - "ecr:PutImage",
19:07:20.261 STDOUT terraform:                           - "ecr:InitiateLayerUpload",
19:07:20.261 STDOUT terraform:                           - "ecr:GetDownloadUrlForLayer",
19:07:20.261 STDOUT terraform:                           - "ecr:CompleteLayerUpload",
19:07:20.261 STDOUT terraform:                           - "ecr:BatchGetImage",
19:07:20.261 STDOUT terraform:                           - "ecr:BatchCheckLayerAvailability",
19:07:20.261 STDOUT terraform:                         ]
19:07:20.261 STDOUT terraform:                       - Effect   = "Allow"
19:07:20.261 STDOUT terraform:                       - Resource = "arn:aws:ecr:ca-central-1:239043911459:repository/notify/api-lambda"
19:07:20.261 STDOUT terraform:                       - Sid      = "AllowPushPull"
19:07:20.261 STDOUT terraform:                     },
19:07:20.261 STDOUT terraform:                   - {
19:07:20.261 STDOUT terraform:                       - Action   = [
19:07:20.261 STDOUT terraform:                           - "lambda:UpdateFunctionCode",
19:07:20.261 STDOUT terraform:                           - "lambda:UpdateAlias",
19:07:20.261 STDOUT terraform:                           - "lambda:PublishVersion",
19:07:20.261 STDOUT terraform:                           - "lambda:ListVersionsByFunction",
19:07:20.261 STDOUT terraform:                           - "lambda:ListAliases",
19:07:20.261 STDOUT terraform:                           - "lambda:GetFunctionConfiguration",
19:07:20.261 STDOUT terraform:                           - "lambda:GetFunction",
19:07:20.261 STDOUT terraform:                           - "lambda:GetAlias",
19:07:20.261 STDOUT terraform:                         ]
19:07:20.261 STDOUT terraform:                       - Effect   = "Allow"
19:07:20.262 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda"
19:07:20.262 STDOUT terraform:                       - Sid      = "PermissionsToUpdateFunction"
19:07:20.262 STDOUT terraform:                     },
19:07:20.262 STDOUT terraform:                   - {
19:07:20.262 STDOUT terraform:                       - Action   = "lambda:GetLayerVersion"
19:07:20.262 STDOUT terraform:                       - Effect   = "Allow"
19:07:20.262 STDOUT terraform:                       - Resource = "arn:aws:lambda:ca-central-1:451483290750:layer:NewRelicPython*:*"
19:07:20.262 STDOUT terraform:                       - Sid      = "PermissionsToDownloadNewRelicLambdaLayers"
19:07:20.262 STDOUT terraform:                     },
19:07:20.262 STDOUT terraform:                 ]
19:07:20.262 STDOUT terraform:               - Version   = "2012-10-17"
19:07:20.262 STDOUT terraform:             }
19:07:20.262 STDOUT terraform:         ) -> (known after apply)
19:07:20.262 STDOUT terraform:         tags             = {}
19:07:20.262 STDOUT terraform:         # (7 unchanged attributes hidden)
19:07:20.262 STDOUT terraform:     }
19:07:20.262 STDOUT terraform:   # aws_lambda_function.api will be updated in-place
19:07:20.262 STDOUT terraform:   ~ resource "aws_lambda_function" "api" {
19:07:20.262 STDOUT terraform:         id                             = "api-lambda"
19:07:20.262 STDOUT terraform:       ~ reserved_concurrent_executions = 850 -> 1250
19:07:20.262 STDOUT terraform:         tags                           = {}
19:07:20.262 STDOUT terraform:         # (28 unchanged attributes hidden)
19:07:20.262 STDOUT terraform:         # (5 unchanged blocks hidden)
19:07:20.262 STDOUT terraform:     }
19:07:20.262 STDOUT terraform:   # null_resource.api_gateway_cloudwatch_logging[0] must be replaced
19:07:20.262 STDOUT terraform: -/+ resource "null_resource" "api_gateway_cloudwatch_logging" {
19:07:20.262 STDOUT terraform:       ~ id       = "2056774041469877766" -> (known after apply)
19:07:20.263 STDOUT terraform:       ~ triggers = { # forces replacement
19:07:20.263 STDOUT terraform:           ~ "always_run" = "2025-08-19T17:30:24Z" -> (known after apply)
19:07:20.263 STDOUT terraform:         }
19:07:20.263 STDOUT terraform:     }
19:07:20.263 STDOUT terraform: Plan: 1 to add, 2 to change, 1 to destroy.
19:07:20.263 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
19:07:20.263 STDOUT terraform: Saved the plan to: plan.tfplan
19:07:20.263 STDOUT terraform: To perform exactly these actions, run the following command to apply:
19:07:20.263 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-critical[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.api-gateway-timeout-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN -...
```

</details>
